/* automatically generated by rust-bindgen 0.69.4 */

#![allow(dead_code,non_upper_case_globals,non_camel_case_types,non_snake_case)]

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const VMBINFINITE: u32 = 4294967295;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = " \\brief 8-bit signed integer."]
pub type VmbInt8_t = ::std::os::raw::c_schar;
#[doc = " \\brief 8-bit unsigned integer."]
pub type VmbUint8_t = ::std::os::raw::c_uchar;
#[doc = " \\brief 16-bit signed integer."]
pub type VmbInt16_t = ::std::os::raw::c_short;
#[doc = " \\brief 16-bit unsigned integer."]
pub type VmbUint16_t = ::std::os::raw::c_ushort;
#[doc = " \\brief 32-bit signed integer."]
pub type VmbInt32_t = ::std::os::raw::c_int;
#[doc = " \\brief 32-bit unsigned integer."]
pub type VmbUint32_t = ::std::os::raw::c_uint;
#[doc = " \\brief 64-bit signed integer."]
pub type VmbInt64_t = ::std::os::raw::c_longlong;
#[doc = " \\brief 64-bit unsigned integer."]
pub type VmbUint64_t = ::std::os::raw::c_ulonglong;
#[doc = " \\brief Handle, e.g. for a camera."]
pub type VmbHandle_t = *mut ::std::os::raw::c_void;
#[doc = " \\brief Boolean type (equivalent to char).\n\n For values see ::VmbBoolVal"]
pub type VmbBool_t = ::std::os::raw::c_char;
pub mod VmbBoolVal {
    #[doc = " \\brief enum for bool values."]
    pub type Type = ::std::os::raw::c_uint;
    pub const VmbBoolTrue: Type = 1;
    pub const VmbBoolFalse: Type = 0;
}
#[doc = " \\brief char type."]
pub type VmbUchar_t = ::std::os::raw::c_uchar;
#[doc = " Character type used for file paths"]
pub type VmbFilePathChar_t = ::std::os::raw::c_char;
pub mod VmbErrorType {
    #[doc = " \\brief Error codes, returned by most functions."]
    pub type Type = ::std::os::raw::c_int;
    #[doc = "!< No error"]
    pub const VmbErrorSuccess: Type = 0;
    #[doc = "!< Unexpected fault in VmbC or driver"]
    pub const VmbErrorInternalFault: Type = -1;
    #[doc = "!< ::VmbStartup() was not called before the current command"]
    pub const VmbErrorApiNotStarted: Type = -2;
    #[doc = "!< The designated instance (camera, feature etc.) cannot be found"]
    pub const VmbErrorNotFound: Type = -3;
    #[doc = "!< The given handle is not valid"]
    pub const VmbErrorBadHandle: Type = -4;
    #[doc = "!< Device was not opened for usage"]
    pub const VmbErrorDeviceNotOpen: Type = -5;
    #[doc = "!< Operation is invalid with the current access mode"]
    pub const VmbErrorInvalidAccess: Type = -6;
    #[doc = "!< One of the parameters is invalid (usually an illegal pointer)"]
    pub const VmbErrorBadParameter: Type = -7;
    #[doc = "!< The given struct size is not valid for this version of the API"]
    pub const VmbErrorStructSize: Type = -8;
    #[doc = "!< More data available in a string/list than space is provided"]
    pub const VmbErrorMoreData: Type = -9;
    #[doc = "!< Wrong feature type for this access function"]
    pub const VmbErrorWrongType: Type = -10;
    #[doc = "!< The value is not valid; either out of bounds or not an increment of the minimum"]
    pub const VmbErrorInvalidValue: Type = -11;
    #[doc = "!< Timeout during wait"]
    pub const VmbErrorTimeout: Type = -12;
    #[doc = "!< Other error"]
    pub const VmbErrorOther: Type = -13;
    #[doc = "!< Resources not available (e.g. memory)"]
    pub const VmbErrorResources: Type = -14;
    #[doc = "!< Call is invalid in the current context (e.g. callback)"]
    pub const VmbErrorInvalidCall: Type = -15;
    #[doc = "!< No transport layers are found"]
    pub const VmbErrorNoTL: Type = -16;
    #[doc = "!< API feature is not implemented"]
    pub const VmbErrorNotImplemented: Type = -17;
    #[doc = "!< API feature is not supported"]
    pub const VmbErrorNotSupported: Type = -18;
    #[doc = "!< The current operation was not completed (e.g. a multiple registers read or write)"]
    pub const VmbErrorIncomplete: Type = -19;
    #[doc = "!< Low level IO error in transport layer"]
    pub const VmbErrorIO: Type = -20;
    #[doc = "!< The valid value set could not be retrieved, since the feature does not provide this property"]
    pub const VmbErrorValidValueSetNotPresent: Type = -21;
    #[doc = "!< Unspecified GenTL runtime error"]
    pub const VmbErrorGenTLUnspecified: Type = -22;
    #[doc = "!< Unspecified runtime error"]
    pub const VmbErrorUnspecified: Type = -23;
    #[doc = "!< The responsible module/entity is busy executing actions"]
    pub const VmbErrorBusy: Type = -24;
    #[doc = "!< The function has no data to work on"]
    pub const VmbErrorNoData: Type = -25;
    #[doc = "!< An error occurred parsing a buffer containing chunk data"]
    pub const VmbErrorParsingChunkData: Type = -26;
    #[doc = "!< Something is already in use"]
    pub const VmbErrorInUse: Type = -27;
    #[doc = "!< Error condition unknown"]
    pub const VmbErrorUnknown: Type = -28;
    #[doc = "!< Error parsing XML"]
    pub const VmbErrorXml: Type = -29;
    #[doc = "!< Something is not available"]
    pub const VmbErrorNotAvailable: Type = -30;
    #[doc = "!< Something is not initialized"]
    pub const VmbErrorNotInitialized: Type = -31;
    #[doc = "!< The given address is out of range or invalid for internal reasons"]
    pub const VmbErrorInvalidAddress: Type = -32;
    #[doc = "!< Something has already been done"]
    pub const VmbErrorAlready: Type = -33;
    #[doc = "!< A frame expected to contain chunk data does not contain chunk data"]
    pub const VmbErrorNoChunkData: Type = -34;
    #[doc = "!< A callback provided by the user threw an exception"]
    pub const VmbErrorUserCallbackException: Type = -35;
    #[doc = "!< The XML for the module is currently not loaded; the module could be in the wrong state or the XML could not be retrieved or could not be parsed properly"]
    pub const VmbErrorFeaturesUnavailable: Type = -36;
    #[doc = "!< A required transport layer could not be found or loaded"]
    pub const VmbErrorTLNotFound: Type = -37;
    #[doc = "!< An entity cannot be uniquely identified based on the information provided"]
    pub const VmbErrorAmbiguous: Type = -39;
    #[doc = "!< Something could not be accomplished with a given number of retries"]
    pub const VmbErrorRetriesExceeded: Type = -40;
    #[doc = "!< The operation requires more buffers"]
    pub const VmbErrorInsufficientBufferCount: Type = -41;
    #[doc = "!< The minimum error code to use for user defined error codes to avoid conflict with existing error codes"]
    pub const VmbErrorCustom: Type = 1;
}
#[doc = " \\brief Type for an error returned by API methods; for values see ::VmbErrorType."]
pub type VmbError_t = VmbInt32_t;
#[doc = " \\brief Version information."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbVersionInfo {
    #[doc = "!< Major version number"]
    pub major: VmbUint32_t,
    #[doc = "!< Minor version number"]
    pub minor: VmbUint32_t,
    #[doc = "!< Patch version number"]
    pub patch: VmbUint32_t,
}
#[test]
fn bindgen_test_layout_VmbVersionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<VmbVersionInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbVersionInfo>(),
        12usize,
        concat!("Size of: ", stringify!(VmbVersionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbVersionInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(VmbVersionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbVersionInfo),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbVersionInfo),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).patch) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbVersionInfo),
            "::",
            stringify!(patch)
        )
    );
}
#[doc = " \\brief Version information."]
pub type VmbVersionInfo_t = VmbVersionInfo;
pub mod VmbPixelType {
    #[doc = " \\brief Indicates if pixel is monochrome or RGB."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Monochrome pixel"]
    pub const VmbPixelMono: Type = 16777216;
    #[doc = "!< Pixel bearing color information"]
    pub const VmbPixelColor: Type = 33554432;
}
pub mod VmbPixelOccupyType {
    #[doc = " \\brief Indicates number of bits for a pixel. Needed for building values of ::VmbPixelFormatType."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Pixel effectively occupies 8 bits"]
    pub const VmbPixelOccupy8Bit: Type = 524288;
    #[doc = "!< Pixel effectively occupies 10 bits"]
    pub const VmbPixelOccupy10Bit: Type = 655360;
    #[doc = "!< Pixel effectively occupies 12 bits"]
    pub const VmbPixelOccupy12Bit: Type = 786432;
    #[doc = "!< Pixel effectively occupies 14 bits"]
    pub const VmbPixelOccupy14Bit: Type = 917504;
    #[doc = "!< Pixel effectively occupies 16 bits"]
    pub const VmbPixelOccupy16Bit: Type = 1048576;
    #[doc = "!< Pixel effectively occupies 24 bits"]
    pub const VmbPixelOccupy24Bit: Type = 1572864;
    #[doc = "!< Pixel effectively occupies 32 bits"]
    pub const VmbPixelOccupy32Bit: Type = 2097152;
    #[doc = "!< Pixel effectively occupies 48 bits"]
    pub const VmbPixelOccupy48Bit: Type = 3145728;
    #[doc = "!< Pixel effectively occupies 64 bits"]
    pub const VmbPixelOccupy64Bit: Type = 4194304;
}
pub mod VmbPixelFormatType {
    #[doc = " \\brief Pixel format types.\n As far as possible, the Pixel Format Naming Convention (PFNC) has been followed, allowing a few deviations.\n If data spans more than one byte, it is always LSB aligned, except if stated differently."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Monochrome, 8 bits (PFNC:  Mono8)"]
    pub const VmbPixelFormatMono8: Type = 17301505;
    #[doc = "!< Monochrome, 10 bits in 16 bits (PFNC:  Mono10)"]
    pub const VmbPixelFormatMono10: Type = 17825795;
    #[doc = "!< Monochrome, 10 bits in 16 bits (PFNC:  Mono10p)"]
    pub const VmbPixelFormatMono10p: Type = 17432646;
    #[doc = "!< Monochrome, 12 bits in 16 bits (PFNC:  Mono12)"]
    pub const VmbPixelFormatMono12: Type = 17825797;
    #[doc = "!< Monochrome, 2x12 bits in 24 bits (GEV:Mono12Packed)"]
    pub const VmbPixelFormatMono12Packed: Type = 17563654;
    #[doc = "!< Monochrome, 2x12 bits in 24 bits (PFNC:  MonoPacked)"]
    pub const VmbPixelFormatMono12p: Type = 17563719;
    #[doc = "!< Monochrome, 14 bits in 16 bits (PFNC:  Mono14)"]
    pub const VmbPixelFormatMono14: Type = 17825829;
    #[doc = "!< Monochrome, 16 bits (PFNC:  Mono16)"]
    pub const VmbPixelFormatMono16: Type = 17825799;
    #[doc = "!< Bayer-color, 8 bits, starting with GR line (PFNC:  BayerGR8)"]
    pub const VmbPixelFormatBayerGR8: Type = 17301512;
    #[doc = "!< Bayer-color, 8 bits, starting with RG line (PFNC:  BayerRG8)"]
    pub const VmbPixelFormatBayerRG8: Type = 17301513;
    #[doc = "!< Bayer-color, 8 bits, starting with GB line (PFNC:  BayerGB8)"]
    pub const VmbPixelFormatBayerGB8: Type = 17301514;
    #[doc = "!< Bayer-color, 8 bits, starting with BG line (PFNC:  BayerBG8)"]
    pub const VmbPixelFormatBayerBG8: Type = 17301515;
    #[doc = "!< Bayer-color, 10 bits in 16 bits, starting with GR line (PFNC:  BayerGR10)"]
    pub const VmbPixelFormatBayerGR10: Type = 17825804;
    #[doc = "!< Bayer-color, 10 bits in 16 bits, starting with RG line (PFNC:  BayerRG10)"]
    pub const VmbPixelFormatBayerRG10: Type = 17825805;
    #[doc = "!< Bayer-color, 10 bits in 16 bits, starting with GB line (PFNC:  BayerGB10)"]
    pub const VmbPixelFormatBayerGB10: Type = 17825806;
    #[doc = "!< Bayer-color, 10 bits in 16 bits, starting with BG line (PFNC:  BayerBG10)"]
    pub const VmbPixelFormatBayerBG10: Type = 17825807;
    #[doc = "!< Bayer-color, 12 bits in 16 bits, starting with GR line (PFNC:  BayerGR12)"]
    pub const VmbPixelFormatBayerGR12: Type = 17825808;
    #[doc = "!< Bayer-color, 12 bits in 16 bits, starting with RG line (PFNC:  BayerRG12)"]
    pub const VmbPixelFormatBayerRG12: Type = 17825809;
    #[doc = "!< Bayer-color, 12 bits in 16 bits, starting with GB line (PFNC:  BayerGB12)"]
    pub const VmbPixelFormatBayerGB12: Type = 17825810;
    #[doc = "!< Bayer-color, 12 bits in 16 bits, starting with BG line (PFNC:  BayerBG12)"]
    pub const VmbPixelFormatBayerBG12: Type = 17825811;
    #[doc = "!< Bayer-color, 2x12 bits in 24 bits, starting with GR line (GEV:BayerGR12Packed)"]
    pub const VmbPixelFormatBayerGR12Packed: Type = 17563690;
    #[doc = "!< Bayer-color, 2x12 bits in 24 bits, starting with RG line (GEV:BayerRG12Packed)"]
    pub const VmbPixelFormatBayerRG12Packed: Type = 17563691;
    #[doc = "!< Bayer-color, 2x12 bits in 24 bits, starting with GB line (GEV:BayerGB12Packed)"]
    pub const VmbPixelFormatBayerGB12Packed: Type = 17563692;
    #[doc = "!< Bayer-color, 2x12 bits in 24 bits, starting with BG line (GEV:BayerBG12Packed)"]
    pub const VmbPixelFormatBayerBG12Packed: Type = 17563693;
    #[doc = "!< Bayer-color, 10 bits continuous packed, starting with GR line (PFNC:  BayerGR10p)"]
    pub const VmbPixelFormatBayerGR10p: Type = 17432662;
    #[doc = "!< Bayer-color, 10 bits continuous packed, starting with RG line (PFNC:  BayerRG10p)"]
    pub const VmbPixelFormatBayerRG10p: Type = 17432664;
    #[doc = "!< Bayer-color, 10 bits continuous packed, starting with GB line (PFNC:  BayerGB10p)"]
    pub const VmbPixelFormatBayerGB10p: Type = 17432660;
    #[doc = "!< Bayer-color, 10 bits continuous packed, starting with BG line (PFNC:  BayerBG10p)"]
    pub const VmbPixelFormatBayerBG10p: Type = 17432658;
    #[doc = "!< Bayer-color, 12 bits continuous packed, starting with GR line (PFNC:  BayerGR12p)"]
    pub const VmbPixelFormatBayerGR12p: Type = 17563735;
    #[doc = "!< Bayer-color, 12 bits continuous packed, starting with RG line (PFNC:  BayerRG12p)"]
    pub const VmbPixelFormatBayerRG12p: Type = 17563737;
    #[doc = "!< Bayer-color, 12 bits continuous packed, starting with GB line (PFNC:  BayerGB12p)"]
    pub const VmbPixelFormatBayerGB12p: Type = 17563733;
    #[doc = "!< Bayer-color, 12 bits continuous packed, starting with BG line (PFNC: BayerBG12p)"]
    pub const VmbPixelFormatBayerBG12p: Type = 17563731;
    #[doc = "!< Bayer-color, 16 bits, starting with GR line (PFNC: BayerGR16)"]
    pub const VmbPixelFormatBayerGR16: Type = 17825838;
    #[doc = "!< Bayer-color, 16 bits, starting with RG line (PFNC: BayerRG16)"]
    pub const VmbPixelFormatBayerRG16: Type = 17825839;
    #[doc = "!< Bayer-color, 16 bits, starting with GB line (PFNC: BayerGB16)"]
    pub const VmbPixelFormatBayerGB16: Type = 17825840;
    #[doc = "!< Bayer-color, 16 bits, starting with BG line (PFNC: BayerBG16)"]
    pub const VmbPixelFormatBayerBG16: Type = 17825841;
    #[doc = "!< RGB, 8 bits x 3 (PFNC: RGB8)"]
    pub const VmbPixelFormatRgb8: Type = 35127316;
    #[doc = "!< BGR, 8 bits x 3 (PFNC: BGR8)"]
    pub const VmbPixelFormatBgr8: Type = 35127317;
    #[doc = "!< RGB, 12 bits in 16 bits x 3 (PFNC: RGB12)"]
    pub const VmbPixelFormatRgb10: Type = 36700184;
    #[doc = "!< RGB, 12 bits in 16 bits x 3 (PFNC: RGB12)"]
    pub const VmbPixelFormatBgr10: Type = 36700185;
    #[doc = "!< RGB, 12 bits in 16 bits x 3 (PFNC: RGB12)"]
    pub const VmbPixelFormatRgb12: Type = 36700186;
    #[doc = "!< RGB, 12 bits in 16 bits x 3 (PFNC: RGB12)"]
    pub const VmbPixelFormatBgr12: Type = 36700187;
    #[doc = "!< RGB, 14 bits in 16 bits x 3 (PFNC: RGB12)"]
    pub const VmbPixelFormatRgb14: Type = 36700254;
    #[doc = "!< RGB, 14 bits in 16 bits x 3 (PFNC: RGB12)"]
    pub const VmbPixelFormatBgr14: Type = 36700234;
    #[doc = "!< RGB, 16 bits x 3 (PFNC: RGB16)"]
    pub const VmbPixelFormatRgb16: Type = 36700211;
    #[doc = "!< RGB, 16 bits x 3 (PFNC: RGB16)"]
    pub const VmbPixelFormatBgr16: Type = 36700235;
    #[doc = "!< ARGB, 8 bits x 4 (PFNC: RGBa8)"]
    pub const VmbPixelFormatArgb8: Type = 35651606;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatRgba8: Type = 35651606;
    #[doc = "!< BGRA, 8 bits x 4 (PFNC: BGRa8)"]
    pub const VmbPixelFormatBgra8: Type = 35651607;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatRgba10: Type = 37748831;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatBgra10: Type = 37748812;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatRgba12: Type = 37748833;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatBgra12: Type = 37748814;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatRgba14: Type = 37748835;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatBgra14: Type = 37748816;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatRgba16: Type = 37748836;
    #[doc = "!< RGBA, 8 bits x 4, legacy name"]
    pub const VmbPixelFormatBgra16: Type = 37748817;
    #[doc = "!< YUV 4:1:1 with 8 bits (PFNC: YUV411_8_UYYVYY, GEV:YUV411Packed)"]
    pub const VmbPixelFormatYuv411: Type = 34340894;
    #[doc = "!< YUV 4:2:2 with 8 bits (PFNC: YUV422_8_UYVY, GEV:YUV422Packed)"]
    pub const VmbPixelFormatYuv422: Type = 34603039;
    #[doc = "!< YUV 4:4:4 with 8 bits (PFNC: YUV8_UYV, GEV:YUV444Packed)"]
    pub const VmbPixelFormatYuv444: Type = 35127328;
    #[doc = "!< YUV 4:2:2 with 8 bits Channel order YUYV (PFNC: YUV422_8)"]
    pub const VmbPixelFormatYuv422_8: Type = 34603058;
    #[doc = "!< YCbCr 4:4:4 with 8 bits (PFNC: YCbCr8_CbYCr) - identical to VmbPixelFormatYuv444"]
    pub const VmbPixelFormatYCbCr8_CbYCr: Type = 35127354;
    #[doc = "!< YCbCr 4:2:2 8-bit YCbYCr (PFNC: YCbCr422_8)"]
    pub const VmbPixelFormatYCbCr422_8: Type = 34603067;
    #[doc = "!< YCbCr 4:1:1 with 8 bits (PFNC: YCbCr411_8_CbYYCrYY) - identical to VmbPixelFormatYuv411"]
    pub const VmbPixelFormatYCbCr411_8_CbYYCrYY: Type = 34340924;
    #[doc = "!< YCbCr601 4:4:4 8-bit CbYCrt (PFNC: YCbCr601_8_CbYCr)"]
    pub const VmbPixelFormatYCbCr601_8_CbYCr: Type = 35127357;
    #[doc = "!< YCbCr601 4:2:2 8-bit YCbYCr (PFNC: YCbCr601_422_8)"]
    pub const VmbPixelFormatYCbCr601_422_8: Type = 34603070;
    #[doc = "!< YCbCr601 4:1:1 8-bit CbYYCrYY (PFNC: YCbCr601_411_8_CbYYCrYY)"]
    pub const VmbPixelFormatYCbCr601_411_8_CbYYCrYY: Type = 34340927;
    #[doc = "!< YCbCr709 4:4:4 8-bit CbYCr (PFNC: YCbCr709_8_CbYCr)"]
    pub const VmbPixelFormatYCbCr709_8_CbYCr: Type = 35127360;
    #[doc = "!< YCbCr709 4:2:2 8-bit YCbYCr (PFNC: YCbCr709_422_8)"]
    pub const VmbPixelFormatYCbCr709_422_8: Type = 34603073;
    #[doc = "!< YCbCr709 4:1:1 8-bit CbYYCrYY (PFNC: YCbCr709_411_8_CbYYCrYY)"]
    pub const VmbPixelFormatYCbCr709_411_8_CbYYCrYY: Type = 34340930;
    #[doc = "!< YCbCr 4:2:2 with 8 bits (PFNC: YCbCr422_8_CbYCrY) - identical to VmbPixelFormatYuv422"]
    pub const VmbPixelFormatYCbCr422_8_CbYCrY: Type = 34603075;
    #[doc = "!< YCbCr601 4:2:2 8-bit CbYCrY (PFNC: YCbCr601_422_8_CbYCrY)"]
    pub const VmbPixelFormatYCbCr601_422_8_CbYCrY: Type = 34603076;
    #[doc = "!< YCbCr709 4:2:2 8-bit CbYCrY (PFNC: YCbCr709_422_8_CbYCrY)"]
    pub const VmbPixelFormatYCbCr709_422_8_CbYCrY: Type = 34603077;
    #[doc = "!< YCbCr 4:1:1 8-bit YYCbYYCr (PFNC: YCbCr411_8)"]
    pub const VmbPixelFormatYCbCr411_8: Type = 34340954;
    #[doc = "!< YCbCr 4:4:4 8-bit YCbCr (PFNC: YCbCr8)"]
    pub const VmbPixelFormatYCbCr8: Type = 35127387;
    pub const VmbPixelFormatLast: Type = 35127388;
}
#[doc = " \\brief Type for the pixel format; for values see ::VmbPixelFormatType."]
pub type VmbPixelFormat_t = VmbUint32_t;
pub mod VmbTransportLayerType {
    #[doc = " \\brief Camera or transport layer type (for instance U3V or GEV)."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Interface is not known to this version of the API"]
    pub const VmbTransportLayerTypeUnknown: Type = 0;
    #[doc = "!< GigE Vision"]
    pub const VmbTransportLayerTypeGEV: Type = 1;
    #[doc = "!< Camera Link"]
    pub const VmbTransportLayerTypeCL: Type = 2;
    #[doc = "!< IIDC 1394"]
    pub const VmbTransportLayerTypeIIDC: Type = 3;
    #[doc = "!< USB video class"]
    pub const VmbTransportLayerTypeUVC: Type = 4;
    #[doc = "!< CoaXPress"]
    pub const VmbTransportLayerTypeCXP: Type = 5;
    #[doc = "!< Camera Link HS"]
    pub const VmbTransportLayerTypeCLHS: Type = 6;
    #[doc = "!< USB3 Vision Standard"]
    pub const VmbTransportLayerTypeU3V: Type = 7;
    #[doc = "!< Generic Ethernet"]
    pub const VmbTransportLayerTypeEthernet: Type = 8;
    #[doc = "!< PCI / PCIe"]
    pub const VmbTransportLayerTypePCI: Type = 9;
    #[doc = "!< Non standard"]
    pub const VmbTransportLayerTypeCustom: Type = 10;
    #[doc = "!< Mixed (transport layer only)"]
    pub const VmbTransportLayerTypeMixed: Type = 11;
}
#[doc = " \\brief Type for an Interface; for values see ::VmbTransportLayerType."]
pub type VmbTransportLayerType_t = VmbUint32_t;
#[doc = " \\brief Transport layer information.\n\n Holds read-only information about a transport layer."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbTransportLayerInfo {
    #[doc = "!< Unique id of the transport layer"]
    pub transportLayerIdString: *const ::std::os::raw::c_char,
    #[doc = "!< Name of the transport layer"]
    pub transportLayerName: *const ::std::os::raw::c_char,
    #[doc = "!< Model name of the transport layer"]
    pub transportLayerModelName: *const ::std::os::raw::c_char,
    #[doc = "!< Vendor of the transport layer"]
    pub transportLayerVendor: *const ::std::os::raw::c_char,
    #[doc = "!< Version of the transport layer"]
    pub transportLayerVersion: *const ::std::os::raw::c_char,
    #[doc = "!< Full path of the transport layer"]
    pub transportLayerPath: *const ::std::os::raw::c_char,
    #[doc = "!< Handle of the transport layer for feature access"]
    pub transportLayerHandle: VmbHandle_t,
    #[doc = "!< The type of the transport layer"]
    pub transportLayerType: VmbTransportLayerType_t,
}
#[test]
fn bindgen_test_layout_VmbTransportLayerInfo() {
    const UNINIT: ::std::mem::MaybeUninit<VmbTransportLayerInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbTransportLayerInfo>(),
        64usize,
        concat!("Size of: ", stringify!(VmbTransportLayerInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbTransportLayerInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VmbTransportLayerInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerIdString) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerIdString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerModelName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerModelName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerVendor) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerVendor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerVersion) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerPath) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerHandle) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerType) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbTransportLayerInfo),
            "::",
            stringify!(transportLayerType)
        )
    );
}
#[doc = " \\brief Transport layer information.\n\n Holds read-only information about a transport layer."]
pub type VmbTransportLayerInfo_t = VmbTransportLayerInfo;
#[doc = " \\brief Interface information.\n\n Holds read-only information about an interface."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbInterfaceInfo {
    #[doc = "!< Identifier of the interface"]
    pub interfaceIdString: *const ::std::os::raw::c_char,
    #[doc = "!< Interface name, given by the transport layer"]
    pub interfaceName: *const ::std::os::raw::c_char,
    #[doc = "!< Handle of the interface for feature access"]
    pub interfaceHandle: VmbHandle_t,
    #[doc = "!< Handle of the related transport layer for feature access"]
    pub transportLayerHandle: VmbHandle_t,
    #[doc = "!< The technology of the interface"]
    pub interfaceType: VmbTransportLayerType_t,
}
#[test]
fn bindgen_test_layout_VmbInterfaceInfo() {
    const UNINIT: ::std::mem::MaybeUninit<VmbInterfaceInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbInterfaceInfo>(),
        40usize,
        concat!("Size of: ", stringify!(VmbInterfaceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbInterfaceInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VmbInterfaceInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceIdString) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbInterfaceInfo),
            "::",
            stringify!(interfaceIdString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbInterfaceInfo),
            "::",
            stringify!(interfaceName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceHandle) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbInterfaceInfo),
            "::",
            stringify!(interfaceHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerHandle) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbInterfaceInfo),
            "::",
            stringify!(transportLayerHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceType) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbInterfaceInfo),
            "::",
            stringify!(interfaceType)
        )
    );
}
#[doc = " \\brief Interface information.\n\n Holds read-only information about an interface."]
pub type VmbInterfaceInfo_t = VmbInterfaceInfo;
pub mod VmbAccessModeType {
    #[doc = " \\brief Access mode for cameras.\n\n Used in ::VmbCameraInfo_t as flags, so multiple modes can be\n announced, while in ::VmbCameraOpen(), no combination must be used."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< No access"]
    pub const VmbAccessModeNone: Type = 0;
    #[doc = "!< Read and write access"]
    pub const VmbAccessModeFull: Type = 1;
    #[doc = "!< Read-only access"]
    pub const VmbAccessModeRead: Type = 2;
    #[doc = "!< Access type unknown"]
    pub const VmbAccessModeUnknown: Type = 4;
    #[doc = "!< Read and write access without permitting access for other consumers"]
    pub const VmbAccessModeExclusive: Type = 8;
}
#[doc = " \\brief Type for an AccessMode; for values see ::VmbAccessModeType."]
pub type VmbAccessMode_t = VmbUint32_t;
#[doc = " \\brief Camera information.\n\n Holds read-only information about a camera."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbCameraInfo {
    #[doc = "!< Identifier of the camera"]
    pub cameraIdString: *const ::std::os::raw::c_char,
    #[doc = "!< globally unique identifier for the camera"]
    pub cameraIdExtended: *const ::std::os::raw::c_char,
    #[doc = "!< The display name of the camera"]
    pub cameraName: *const ::std::os::raw::c_char,
    #[doc = "!< Model name"]
    pub modelName: *const ::std::os::raw::c_char,
    #[doc = "!< Serial number"]
    pub serialString: *const ::std::os::raw::c_char,
    #[doc = "!< Handle of the related transport layer for feature access"]
    pub transportLayerHandle: VmbHandle_t,
    #[doc = "!< Handle of the related interface for feature access"]
    pub interfaceHandle: VmbHandle_t,
    #[doc = "!< Handle of the related GenTL local device. NULL if the camera is not opened"]
    pub localDeviceHandle: VmbHandle_t,
    #[doc = "!< Handles of the streams provided by the camera.  NULL if the camera is not opened"]
    pub streamHandles: *const VmbHandle_t,
    #[doc = "!< Number of stream handles in the streamHandles array"]
    pub streamCount: VmbUint32_t,
    #[doc = "!< Permitted access modes, see ::VmbAccessModeType"]
    pub permittedAccess: VmbAccessMode_t,
}
#[test]
fn bindgen_test_layout_VmbCameraInfo() {
    const UNINIT: ::std::mem::MaybeUninit<VmbCameraInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbCameraInfo>(),
        80usize,
        concat!("Size of: ", stringify!(VmbCameraInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbCameraInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VmbCameraInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraIdString) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(cameraIdString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraIdExtended) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(cameraIdExtended)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(cameraName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modelName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(modelName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).serialString) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(serialString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transportLayerHandle) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(transportLayerHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceHandle) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(interfaceHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localDeviceHandle) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(localDeviceHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamHandles) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(streamHandles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamCount) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(streamCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).permittedAccess) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbCameraInfo),
            "::",
            stringify!(permittedAccess)
        )
    );
}
#[doc = " \\brief Camera information.\n\n Holds read-only information about a camera."]
pub type VmbCameraInfo_t = VmbCameraInfo;
pub mod VmbFeatureDataType {
    #[doc = " \\brief Supported feature data types."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Unknown feature type"]
    pub const VmbFeatureDataUnknown: Type = 0;
    #[doc = "!< 64-bit integer feature"]
    pub const VmbFeatureDataInt: Type = 1;
    #[doc = "!< 64-bit floating point feature"]
    pub const VmbFeatureDataFloat: Type = 2;
    #[doc = "!< Enumeration feature"]
    pub const VmbFeatureDataEnum: Type = 3;
    #[doc = "!< String feature"]
    pub const VmbFeatureDataString: Type = 4;
    #[doc = "!< Boolean feature"]
    pub const VmbFeatureDataBool: Type = 5;
    #[doc = "!< Command feature"]
    pub const VmbFeatureDataCommand: Type = 6;
    #[doc = "!< Raw (direct register access) feature"]
    pub const VmbFeatureDataRaw: Type = 7;
    #[doc = "!< Feature with no data"]
    pub const VmbFeatureDataNone: Type = 8;
}
#[doc = " \\brief Data type for a Feature; for values see ::VmbFeatureDataType."]
pub type VmbFeatureData_t = VmbUint32_t;
pub mod VmbFeatureVisibilityType {
    #[doc = " \\brief Feature visibility."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Feature visibility is not known"]
    pub const VmbFeatureVisibilityUnknown: Type = 0;
    #[doc = "!< Feature is visible in feature list (beginner level)"]
    pub const VmbFeatureVisibilityBeginner: Type = 1;
    #[doc = "!< Feature is visible in feature list (expert level)"]
    pub const VmbFeatureVisibilityExpert: Type = 2;
    #[doc = "!< Feature is visible in feature list (guru level)"]
    pub const VmbFeatureVisibilityGuru: Type = 3;
    #[doc = "!< Feature is visible in the feature list, but should be hidden in GUI applications"]
    pub const VmbFeatureVisibilityInvisible: Type = 4;
}
#[doc = " \\brief Type for Feature visibility; for values see ::VmbFeatureVisibilityType."]
pub type VmbFeatureVisibility_t = VmbUint32_t;
impl VmbFeatureFlagsType {
    #[doc = "!< No additional information is provided"]
    pub const VmbFeatureFlagsNone: VmbFeatureFlagsType = VmbFeatureFlagsType(0);
}
impl VmbFeatureFlagsType {
    #[doc = "!< Static info about read access. Current status depends on access mode, check with ::VmbFeatureAccessQuery()"]
    pub const VmbFeatureFlagsRead: VmbFeatureFlagsType = VmbFeatureFlagsType(1);
}
impl VmbFeatureFlagsType {
    #[doc = "!< Static info about write access. Current status depends on access mode, check with ::VmbFeatureAccessQuery()"]
    pub const VmbFeatureFlagsWrite: VmbFeatureFlagsType = VmbFeatureFlagsType(2);
}
impl VmbFeatureFlagsType {
    #[doc = "!< Value may change at any time"]
    pub const VmbFeatureFlagsVolatile: VmbFeatureFlagsType = VmbFeatureFlagsType(8);
}
impl VmbFeatureFlagsType {
    #[doc = "!< Value may change after a write"]
    pub const VmbFeatureFlagsModifyWrite: VmbFeatureFlagsType = VmbFeatureFlagsType(16);
}
impl ::std::ops::BitOr<VmbFeatureFlagsType> for VmbFeatureFlagsType {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        VmbFeatureFlagsType(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for VmbFeatureFlagsType {
    #[inline]
    fn bitor_assign(&mut self, rhs: VmbFeatureFlagsType) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<VmbFeatureFlagsType> for VmbFeatureFlagsType {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        VmbFeatureFlagsType(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for VmbFeatureFlagsType {
    #[inline]
    fn bitand_assign(&mut self, rhs: VmbFeatureFlagsType) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " \\brief Feature flags."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct VmbFeatureFlagsType(pub ::std::os::raw::c_uint);
#[doc = " \\brief Type for Feature flags; for values see ::VmbFeatureFlagsType."]
pub type VmbFeatureFlags_t = VmbUint32_t;
#[doc = " \\brief Feature information.\n\n Holds read-only information about a feature."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbFeatureInfo {
    #[doc = "!< Name used in the API"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "!< Category this feature can be found in"]
    pub category: *const ::std::os::raw::c_char,
    #[doc = "!< Feature name to be used in GUIs"]
    pub displayName: *const ::std::os::raw::c_char,
    #[doc = "!< Short description, e.g. for a tooltip"]
    pub tooltip: *const ::std::os::raw::c_char,
    #[doc = "!< Longer description"]
    pub description: *const ::std::os::raw::c_char,
    #[doc = "!< Namespace this feature resides in"]
    pub sfncNamespace: *const ::std::os::raw::c_char,
    #[doc = "!< Measuring unit as given in the XML file"]
    pub unit: *const ::std::os::raw::c_char,
    #[doc = "!< Representation of a numeric feature"]
    pub representation: *const ::std::os::raw::c_char,
    #[doc = "!< Data type of this feature"]
    pub featureDataType: VmbFeatureData_t,
    #[doc = "!< Access flags for this feature"]
    pub featureFlags: VmbFeatureFlags_t,
    #[doc = "!< Predefined polling time for volatile features"]
    pub pollingTime: VmbUint32_t,
    #[doc = "!< GUI visibility"]
    pub visibility: VmbFeatureVisibility_t,
    #[doc = "!< Indicates if a feature can be stored to / loaded from a file"]
    pub isStreamable: VmbBool_t,
    #[doc = "!< Indicates if the feature selects other features"]
    pub hasSelectedFeatures: VmbBool_t,
}
#[test]
fn bindgen_test_layout_VmbFeatureInfo() {
    const UNINIT: ::std::mem::MaybeUninit<VmbFeatureInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbFeatureInfo>(),
        88usize,
        concat!("Size of: ", stringify!(VmbFeatureInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbFeatureInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VmbFeatureInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).category) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(category)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(displayName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tooltip) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(tooltip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sfncNamespace) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(sfncNamespace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).representation) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(representation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).featureDataType) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(featureDataType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).featureFlags) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(featureFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pollingTime) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(pollingTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).visibility) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(visibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isStreamable) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(isStreamable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasSelectedFeatures) as usize - ptr as usize },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureInfo),
            "::",
            stringify!(hasSelectedFeatures)
        )
    );
}
#[doc = " \\brief Feature information.\n\n Holds read-only information about a feature."]
pub type VmbFeatureInfo_t = VmbFeatureInfo;
#[doc = " \\brief Info about possible entries of an enumeration feature."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbFeatureEnumEntry {
    #[doc = "!< Name used in the API"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "!< Enumeration entry name to be used in GUIs"]
    pub displayName: *const ::std::os::raw::c_char,
    #[doc = "!< Short description, e.g. for a tooltip"]
    pub tooltip: *const ::std::os::raw::c_char,
    #[doc = "!< Longer description"]
    pub description: *const ::std::os::raw::c_char,
    #[doc = "!< Integer value of this enumeration entry"]
    pub intValue: VmbInt64_t,
    #[doc = "!< Namespace this feature resides in"]
    pub sfncNamespace: *const ::std::os::raw::c_char,
    #[doc = "!< GUI visibility"]
    pub visibility: VmbFeatureVisibility_t,
}
#[test]
fn bindgen_test_layout_VmbFeatureEnumEntry() {
    const UNINIT: ::std::mem::MaybeUninit<VmbFeatureEnumEntry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbFeatureEnumEntry>(),
        56usize,
        concat!("Size of: ", stringify!(VmbFeatureEnumEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbFeatureEnumEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(VmbFeatureEnumEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(displayName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tooltip) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(tooltip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intValue) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(intValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sfncNamespace) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(sfncNamespace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).visibility) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeatureEnumEntry),
            "::",
            stringify!(visibility)
        )
    );
}
#[doc = " \\brief Info about possible entries of an enumeration feature."]
pub type VmbFeatureEnumEntry_t = VmbFeatureEnumEntry;
pub mod VmbFrameStatusType {
    #[doc = " \\brief Status of a frame transfer."]
    pub type Type = ::std::os::raw::c_int;
    #[doc = "!< Frame has been completed without errors"]
    pub const VmbFrameStatusComplete: Type = 0;
    #[doc = "!< Frame could not be filled to the end"]
    pub const VmbFrameStatusIncomplete: Type = -1;
    #[doc = "!< Frame buffer was too small"]
    pub const VmbFrameStatusTooSmall: Type = -2;
    #[doc = "!< Frame buffer was invalid"]
    pub const VmbFrameStatusInvalid: Type = -3;
}
#[doc = " \\brief Type for the frame status; for values see ::VmbFrameStatusType."]
pub type VmbFrameStatus_t = VmbInt32_t;
impl VmbFrameFlagsType {
    #[doc = "!< No additional information is provided"]
    pub const VmbFrameFlagsNone: VmbFrameFlagsType = VmbFrameFlagsType(0);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::width and VmbFrame_t::height are provided"]
    pub const VmbFrameFlagsDimension: VmbFrameFlagsType = VmbFrameFlagsType(1);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::offsetX and VmbFrame_t::offsetY are provided (ROI)"]
    pub const VmbFrameFlagsOffset: VmbFrameFlagsType = VmbFrameFlagsType(2);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::frameID is provided"]
    pub const VmbFrameFlagsFrameID: VmbFrameFlagsType = VmbFrameFlagsType(4);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::timestamp is provided"]
    pub const VmbFrameFlagsTimestamp: VmbFrameFlagsType = VmbFrameFlagsType(8);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::imageData is provided"]
    pub const VmbFrameFlagsImageData: VmbFrameFlagsType = VmbFrameFlagsType(16);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::payloadType is provided"]
    pub const VmbFrameFlagsPayloadType: VmbFrameFlagsType = VmbFrameFlagsType(32);
}
impl VmbFrameFlagsType {
    #[doc = "!< VmbFrame_t::chunkDataPresent is set based on info provided by the transport layer"]
    pub const VmbFrameFlagsChunkDataPresent: VmbFrameFlagsType = VmbFrameFlagsType(64);
}
impl ::std::ops::BitOr<VmbFrameFlagsType> for VmbFrameFlagsType {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        VmbFrameFlagsType(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for VmbFrameFlagsType {
    #[inline]
    fn bitor_assign(&mut self, rhs: VmbFrameFlagsType) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<VmbFrameFlagsType> for VmbFrameFlagsType {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        VmbFrameFlagsType(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for VmbFrameFlagsType {
    #[inline]
    fn bitand_assign(&mut self, rhs: VmbFrameFlagsType) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " \\brief Frame flags."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct VmbFrameFlagsType(pub ::std::os::raw::c_uint);
#[doc = " \\brief Type for Frame flags; for values see ::VmbFrameFlagsType."]
pub type VmbFrameFlags_t = VmbUint32_t;
pub mod VmbPayloadType {
    #[doc = " \\brief Frame payload type."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Unknown payload type"]
    pub const VmbPayloadTypeUnknown: Type = 0;
    #[doc = "!< image data"]
    pub const VmbPayloadTypeImage: Type = 1;
    #[doc = "!< raw data"]
    pub const VmbPayloadTypeRaw: Type = 2;
    #[doc = "!< file data"]
    pub const VmbPayloadTypeFile: Type = 3;
    #[doc = "!< JPEG data as described in the GigEVision 2.0 specification"]
    pub const VmbPayloadTypeJPEG: Type = 5;
    #[doc = "!< JPEG 2000 data as described in the GigEVision 2.0 specification"]
    pub const VmbPayloadTypJPEG2000: Type = 6;
    #[doc = "!< H.264 data as described in the GigEVision 2.0 specification"]
    pub const VmbPayloadTypeH264: Type = 7;
    #[doc = "!< Chunk data exclusively"]
    pub const VmbPayloadTypeChunkOnly: Type = 8;
    #[doc = "!< Device specific data format"]
    pub const VmbPayloadTypeDeviceSpecific: Type = 9;
    #[doc = "!< GenDC data"]
    pub const VmbPayloadTypeGenDC: Type = 11;
}
#[doc = " \\brief Type representing the payload type of a frame. For values see ::VmbPayloadType."]
pub type VmbPayloadType_t = VmbUint32_t;
#[doc = " \\brief Type used to represent a dimension value, e.g. the image height."]
pub type VmbImageDimension_t = VmbUint32_t;
#[doc = " \\brief Frame delivered by the camera."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbFrame {
    #[doc = "!< Comprises image and potentially chunk data"]
    pub buffer: *mut ::std::os::raw::c_void,
    #[doc = "!< The size of the data buffer"]
    pub bufferSize: VmbUint32_t,
    #[doc = "!< 4 void pointers that can be employed by the user (e.g. for storing handles)"]
    pub context: [*mut ::std::os::raw::c_void; 4usize],
    #[doc = "!< The resulting status of the receive operation"]
    pub receiveStatus: VmbFrameStatus_t,
    #[doc = "!< Unique ID of this frame in this stream"]
    pub frameID: VmbUint64_t,
    #[doc = "!< The timestamp set by the camera"]
    pub timestamp: VmbUint64_t,
    #[doc = "!< The start of the image data, if present, or null"]
    pub imageData: *mut VmbUint8_t,
    #[doc = "!< Flags indicating which additional frame information is available"]
    pub receiveFlags: VmbFrameFlags_t,
    #[doc = "!< Pixel format of the image"]
    pub pixelFormat: VmbPixelFormat_t,
    #[doc = "!< Width of an image"]
    pub width: VmbImageDimension_t,
    #[doc = "!< Height of an image"]
    pub height: VmbImageDimension_t,
    #[doc = "!< Horizontal offset of an image"]
    pub offsetX: VmbImageDimension_t,
    #[doc = "!< Vertical offset of an image"]
    pub offsetY: VmbImageDimension_t,
    #[doc = "!< The type of payload"]
    pub payloadType: VmbPayloadType_t,
    #[doc = "!< True if the transport layer reported chunk data to be present in the buffer"]
    pub chunkDataPresent: VmbBool_t,
}
#[test]
fn bindgen_test_layout_VmbFrame() {
    const UNINIT: ::std::mem::MaybeUninit<VmbFrame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbFrame>(),
        112usize,
        concat!("Size of: ", stringify!(VmbFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbFrame>(),
        8usize,
        concat!("Alignment of ", stringify!(VmbFrame))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bufferSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(bufferSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).receiveStatus) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(receiveStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameID) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(frameID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imageData) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(imageData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).receiveFlags) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(receiveFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pixelFormat) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(pixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offsetX) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(offsetX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offsetY) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(offsetY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).payloadType) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(payloadType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chunkDataPresent) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFrame),
            "::",
            stringify!(chunkDataPresent)
        )
    );
}
#[doc = " \\brief Frame delivered by the camera."]
pub type VmbFrame_t = VmbFrame;
pub mod VmbFeaturePersistType {
    #[doc = " \\brief Type of features that are to be saved (persisted) to the XML file when using ::VmbSettingsSave"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Save all features to XML, including look-up tables (if possible)"]
    pub const VmbFeaturePersistAll: Type = 0;
    #[doc = "!< Save only features marked as streamable, excluding look-up tables"]
    pub const VmbFeaturePersistStreamable: Type = 1;
    #[doc = "!< Save all features except look-up tables (default)"]
    pub const VmbFeaturePersistNoLUT: Type = 2;
}
#[doc = " \\brief Type for feature persistence; for values see ::VmbFeaturePersistType."]
pub type VmbFeaturePersist_t = VmbUint32_t;
pub mod VmbModulePersistFlagsType {
    #[doc = " \\brief Parameters determining the operation mode of ::VmbSettingsSave and ::VmbSettingsLoad."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Persist/Load features for no module."]
    pub const VmbModulePersistFlagsNone: Type = 0;
    #[doc = "!< Persist/Load the transport layer features."]
    pub const VmbModulePersistFlagsTransportLayer: Type = 1;
    #[doc = "!< Persist/Load the interface features."]
    pub const VmbModulePersistFlagsInterface: Type = 2;
    #[doc = "!< Persist/Load the remote device features."]
    pub const VmbModulePersistFlagsRemoteDevice: Type = 4;
    #[doc = "!< Persist/Load the local device features."]
    pub const VmbModulePersistFlagsLocalDevice: Type = 8;
    #[doc = "!< Persist/Load the features of stream modules."]
    pub const VmbModulePersistFlagsStreams: Type = 16;
    #[doc = "!< Persist/Load features for all modules."]
    pub const VmbModulePersistFlagsAll: Type = 255;
}
#[doc = " \\brief Type for module persist flags; for values see VmbModulePersistFlagsType\n\n Use a combination of ::VmbModulePersistFlagsType constants"]
pub type VmbModulePersistFlags_t = VmbUint32_t;
pub mod VmbLogLevel {
    #[doc = " \\brief A level to use for logging"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = "!< Nothing is logged regardless of the severity of the issue"]
    pub const VmbLogLevelNone: Type = 0;
    #[doc = "!< Only errors are logged"]
    pub const VmbLogLevelError: Type = 1;
    #[doc = "!< Only error and debug messages are logged"]
    pub const VmbLogLevelDebug: Type = 2;
    #[doc = "!< Only error, debug and warn messages are logged"]
    pub const VmbLogLevelWarn: Type = 3;
    #[doc = "!< all messages are logged"]
    pub const VmbLogLevelTrace: Type = 4;
    #[doc = "!< all messages are logged"]
    pub const VmbLogLevelAll: Type = 4;
}
#[doc = " \\brief The type used for storing the log level\n\n Use a constant from ::VmbLogLevel"]
pub type VmbLogLevel_t = VmbUint32_t;
#[doc = " \\brief Parameters determining the operation mode of ::VmbSettingsSave and ::VmbSettingsLoad"]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct VmbFeaturePersistSettings {
    #[doc = "!< Type of features that are to be saved"]
    pub persistType: VmbFeaturePersist_t,
    #[doc = "!< Flags specifying the modules to persist/load"]
    pub modulePersistFlags: VmbModulePersistFlags_t,
    #[doc = "!< Number of iterations when loading settings"]
    pub maxIterations: VmbUint32_t,
    #[doc = "!< Determines level of detail for load/save settings logging"]
    pub loggingLevel: VmbLogLevel_t,
}
#[test]
fn bindgen_test_layout_VmbFeaturePersistSettings() {
    const UNINIT: ::std::mem::MaybeUninit<VmbFeaturePersistSettings> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VmbFeaturePersistSettings>(),
        16usize,
        concat!("Size of: ", stringify!(VmbFeaturePersistSettings))
    );
    assert_eq!(
        ::std::mem::align_of::<VmbFeaturePersistSettings>(),
        4usize,
        concat!("Alignment of ", stringify!(VmbFeaturePersistSettings))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).persistType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeaturePersistSettings),
            "::",
            stringify!(persistType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modulePersistFlags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeaturePersistSettings),
            "::",
            stringify!(modulePersistFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxIterations) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeaturePersistSettings),
            "::",
            stringify!(maxIterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loggingLevel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VmbFeaturePersistSettings),
            "::",
            stringify!(loggingLevel)
        )
    );
}
#[doc = " \\brief Parameters determining the operation mode of ::VmbSettingsSave and ::VmbSettingsLoad"]
pub type VmbFeaturePersistSettings_t = VmbFeaturePersistSettings;
